In [23]:
import getpass
import pymysql
from sqlalchemy import create_engine

mysql_domain = "localhost"
mysql_user = "root"
mysql_password = getpass.getpass()
mysql_db = "publis"

dbdata = [mysql_user, mysql_password, mysql_domain, mysql_db]
connection_url = 'mysql+pymysql://{}:{}@{}/{}'.format(*dbdata)
engine = create_engine(connection_url)
print("Connected to DB!")

········
Connected to DB!

In [24]:
import pandas as pd

sqlquery = """
SELECT emp_id, concat(fname," ",lname) Name FROM employee
"""

data = pd.read_sql_query(sqlquery, engine)
print(data.shape)
data.head()

(43, 2)

      emp_id               Name
0  A-C71970F          Aria Cruz
1  A-R89858F     Annette Roulet
2  AMD15433F          Ann Devon
3  ARD36773F  Anabela Domingues
4  CFH28514M    Carlos Hernadez